app/views/instructor/courses/show.html.erb

  <ul class="sections">
    <% current_course.sections.rank(:row_order).each do |section| %>
---
SELECT "sections".* FROM "sections" WHERE "sections"."course_id" = $1 ORDER BY "sections"."row_order" ASC  [["course_id", 3]]

        <ul class="lessons">
          <% section.lessons.rank(:row_order).each do |lesson| %>
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."section_id" = $1 ORDER BY "lessons"."row_order" ASC  [["section_id", 2]]