app/views/instructor/courses/show.html.erb

SELECT "lessons".* FROM "lessons" WHERE "lessons"."section_id" = $1 ORDER BY "lessons"."row_order" ASC  [["section_id", 2]]
---
      <ul class="lessons">
        <% section.lessons.rank(:row_order).each do |lesson| %>