app/controllers/instructor/sections_controller.rb

INSERT INTO "sections" ("title", "course_id", "created_at", "updated_at", "row_order") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "The Next Generation"], ["course_id", 3], ["created_at", "2019-11-23 20:18:04.456641"], ["updated_at", "2019-11-23 20:18:04.456641"], ["row_order", 1073741824]]
---
  def create
    @section = current_course.sections.create(section_params)

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def current_course
    if params[:course_id]
      @current_course ||= Course.find(params[:course_id])