app/views/courses/show.html.erb

SELECT "sections".* FROM "sections" WHERE "sections"."course_id" = $1  [["course_id", 2]]
---
  <div class="col-12">
    <% @course.sections.each do |section| %>

SELECT "lessons".* FROM "lessons" WHERE "lessons"."section_id" = $1  [["section_id", 1]]
---
        <div class="row">
          <% section.lessons.each do |lesson| %>