app/controllers/enrollments_controller.rb

    def create
        current_user.enrollments.create(course: current_course)
---
INSERT INTO "enrollments" ("user_id", "course_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["course_id", 2], ["created_at", "2019-11-13 02:17:09.465703"], ["updated_at", "2019-11-13 02:17:09.465703"]]

    def current_course
      @current_course ||= Course.find(params[:course_id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]