app/controllers/lessons_controller.rb

  def current_lesson
    @current_lesson ||= Lesson.find(params[:id])
---
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]